app/controllers/reservations_controller.rb

  def create
    room = Room.find(params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def your_trips
    @trips = current_user.reservations.order(start_date: :asc)
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ? ORDER BY "reservations"."start_date" ASC  [["user_id", 3]]